# ViewTypeSchedules Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewTypeSchedules Property
ParameterTypeId Class See Also
---
"Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewTypeSchedules { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewTypeSchedules As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewTypeSchedules {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace